app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 9]]
---
<h2>Answers</h2>
<% @question.answers.each do |answer| %>