app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "answers" ("name", "content", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aaa"], ["content", "cccc"], ["question_id", 9], ["created_at", "2024-03-19 09:06:15.467820"], ["updated_at", "2024-03-19 09:06:15.467820"]]
---
  def create
    # p params
    @question = Question.find(params[:question_id])
    @question.answers.create(answer_params)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 9], ["id", 1], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]
---
  def destroy
    @question = Question.find(params[:question_id])
    @answer = @question.answers.find(params[:id])
    @answer.destroy