app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    # p params[:id]
    @question = Question.find(params[:id])

INSERT INTO "questions" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["title", ""], ["content", ""], ["created_at", "2024-03-19 08:15:52.978332"], ["updated_at", "2024-03-19 08:15:52.978332"]]
---
  def create
    @question = Question.new(question_params)
    if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "name" = ?, "title" = ?, "content" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["name", "www"], ["title", "ww"], ["content", "wwwwwwww"], ["updated_at", "2024-03-19 08:29:39.658330"], ["id", 1]]
---
  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)